---
type: FamilyPointLocation
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyPointLocation

`Autodesk.Revit.DB.FamilyPointLocation` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetLocation | 2017 | `public Transform GetLocation ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | — | `public string Name { get ; }` |